/*
PRIMARY KEY : CUST_NO
인덱스      : CUST_CD + FLAG + DIV

T_CUST22  200만건
  - CUST_CD   200개 종류(001 ~ 200),  코드당 건수는 약  1만건 
  - DIV       100개 종류(001 ~ 100),  코드당 건수는 약  2만건
  - FLAG      10개  종류,    코드당 건수는 약 20만건

-----------------------------------------------------------------------
| Id  | Operation                   | Name           |A-Rows| Buffers |
-----------------------------------------------------------------------
|   0 | SELECT STATEMENT            |                |   122|     296 |
|   1 |  TABLE ACCESS BY INDEX ROWID| T_CUST22       |   122|     296 |
|*  2 |   INDEX RANGE SCAN          | IX_T_CUST22_01 |   122|     174 |
-----------------------------------------------------------------------
  
아래 SQL을 보고 튜닝 하시오(인덱스 및 SQL변경 가능)
*/

ALTER SESSION SET STATISTICS_LEVEL = ALL;
SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY_CURSOR(NULL, NULL, 'ALLSTATS LAST'));
SELECT /*+ GATHER_PLAN_STATISTICS INDEX(T_CUST22 IX_T_CUST22_02) */*
FROM T_CUST22 
WHERE  CUST_CD BETWEEN '150' AND '200' 
AND   DIV IN ('30', '40')
AND   FLAG = '160'
;
/*
-----------------------------------------------------------------------------------------------------------------
| Id  | Operation                   | Name           | Starts | E-Rows | A-Rows |   A-Time   | Buffers | Reads  |
-----------------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT            |                |      1 |        |    138 |00:00:00.05 |     312 |    303 |
|   1 |  TABLE ACCESS BY INDEX ROWID| T_CUST22       |      1 |     77 |    138 |00:00:00.05 |     312 |    303 |
|*  2 |   INDEX RANGE SCAN          | IX_T_CUST22_01 |      1 |      2 |    138 |00:00:00.04 |     174 |    171 |
-----------------------------------------------------------------------------------------------------------------
*/

/* 튜닝 후 */
CREATE INDEX IX_T_CUST22_02 ON T_CUST22(DIV, FLAG, CUST_CD);
/*
------------------------------------------------------------------------------------------------------------------
| Id  | Operation                    | Name           | Starts | E-Rows | A-Rows |   A-Time   | Buffers | Reads  |
------------------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT             |                |      1 |        |    138 |00:00:00.02 |     146 |      3 |
|   1 |  INLIST ITERATOR             |                |      1 |        |    138 |00:00:00.02 |     146 |      3 |
|   2 |   TABLE ACCESS BY INDEX ROWID| T_CUST22       |      2 |     77 |    138 |00:00:00.02 |     146 |      3 |
|*  3 |    INDEX RANGE SCAN          | IX_T_CUST22_02 |      2 |      1 |    138 |00:00:00.02 |       8 |      3 |
------------------------------------------------------------------------------------------------------------------
*/